testhound/alo/alo/octave/m480/M480SemanticVisitor.cpp
#include <string>
#include <exception>
#include <cassert>

#include <Alo.h>
#include <LlirException.h>

#include "M480Instructions.h"
#include "M480SemanticVisitor.h"

//externs...
using namespace Llir;
extern int optimize;  // Defined in gcc/gcc/toplev.c 
extern std::map<string, shared_ptr<const PrototypeDirective> > g_prototypeDirList;
typedef std::map<string, shared_ptr<const PrototypeDirective> >::iterator PrototypeListIter;



namespace Alo
{
  //////////////////////////////////////////
  //
  // M480SemanticAnalysisVisitor functions
  //
  //////////////////////////////////////////
 
  M480SemanticAnalysisVisitor::M480SemanticAnalysisVisitor(OctaveAlo &o) 
    : OctaveSemanticAnalysisVisitor(o)
  {}
 
  
  M480SemanticAnalysisVisitor::~M480SemanticAnalysisVisitor()
  {}
  
  //////////////////////////////////////////
  //private utility functions
  //////////////////////////////////////////

  void
  M480SemanticAnalysisVisitor::
  checkForValidLabel(OctaveAlo &alo,
		    shared_ptr<const LlirOperand> opnd, 
		    unsigned int excLine,
		    const string &excFile) const
  {
    shared_ptr<std::exception> exc; 
    shared_ptr<const OpndLabel> opndLabel = shared_dynamic_cast<const OpndLabel>(opnd);

    // Only do this check if optimization is on.
    if ((optimize) && (! opndLabel))
      {
	char *excStr = new char[128];
	sprintf(excStr, "illegal label operand");
	    exc = shared_ptr<IllegalLabelOperand> 
	      (new IllegalLabelOperand
	       (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
      }
  }
  

  void
  M480SemanticAnalysisVisitor::
  checkForReturnRegister(OctaveAlo &alo,
		    shared_ptr<const LlirOperand> opnd, 
		    unsigned int excLine,
		    const string &excFile) const
  {
    shared_ptr<std::exception> exc; 
    shared_ptr<const OpndNull> nullOpnd = shared_dynamic_cast<const OpndNull>(opnd);
    shared_ptr<const Register> regOpnd = shared_dynamic_cast<const Register>(opnd);

    if(! nullOpnd)
      {
	if(regOpnd)
	  {
	    unsigned int rpc = regOpnd->getRegNum();
	    if((rpc < 60) || (rpc > 62))
	      {
		 char *excStr = new char[128];
		 sprintf(excStr, "illegal RPC Register: r%d", rpc);
		 exc = shared_ptr<IllegalRegisterOperand> 
		   (new IllegalRegisterOperand
		    (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
		 alo.logException(exc);
		 delete excStr;
	      }
	  }
	else
	  {
	    char *excStr = new char[128];
	    sprintf(excStr, "illegal RPC register operand");
	    exc = shared_ptr<IllegalRegisterOperand> 
	      (new IllegalRegisterOperand
	       (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
	  }
      }
  }


 void
  M480SemanticAnalysisVisitor::
  checkForValidCDFlag(OctaveAlo &alo,
		    shared_ptr<const LlirOperand> opnd, 
		    unsigned int excLine,
		    const string &excFile) const
  {
    shared_ptr<std::exception> exc; 
    shared_ptr<const OpndNull> nullOpnd = shared_dynamic_cast<const OpndNull>(opnd);
    shared_ptr<const CDFlag> cdFlag = shared_dynamic_cast<const CDFlag>(opnd);

    if(! (nullOpnd || cdFlag))
      {
	char *excStr = new char[128];
	sprintf(excStr, "unknown cd flag");
	    exc = shared_ptr<IllegalLabelOperand> 
	      (new IllegalLabelOperand
	       (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
      }
  }

  void
  M480SemanticAnalysisVisitor::
  checkForValidESSFlag(OctaveAlo &alo,
		    shared_ptr<const LlirOperand> opnd, 
		    unsigned int excLine,
		    const string &excFile) const
  {
    shared_ptr<std::exception> exc; 
    shared_ptr<const OpndNull> nullOpnd = shared_dynamic_cast<const OpndNull>(opnd);
    shared_ptr<const EssFlag> essFlag = shared_dynamic_cast<const EssFlag>(opnd);

    if(! (nullOpnd || essFlag))
      {
	char *excStr = new char[128];
	sprintf(excStr, "unknown ess flag");
	    exc = shared_ptr<IllegalLabelOperand> 
	      (new IllegalLabelOperand
	       (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
      }
  }
  void
  M480SemanticAnalysisVisitor::
  checkForValidCandBfFlags(OctaveAlo &alo,
		    shared_ptr<const LlirOperand> opnd, 
		    unsigned int excLine,
		    const string &excFile) const
  {
    shared_ptr<std::exception> exc; 
    shared_ptr<const OpndNull> nullOpnd = shared_dynamic_cast<const OpndNull>(opnd);
    shared_ptr<const CbranchFlags> cbranchFlags = shared_dynamic_cast<const CbranchFlags>(opnd);


    if(! (nullOpnd || cbranchFlags))
      {
	char *excStr = new char[128];
	sprintf(excStr, "unknown cbranch flag");
	    exc = shared_ptr<IllegalLabelOperand> 
	      (new IllegalLabelOperand
	       (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
      }
  }

  
  void
  M480SemanticAnalysisVisitor::
  checkSImm17Range (OctaveAlo &alo,
		    shared_ptr<const LlirOperand> opnd, 
		    unsigned int excLine,
		    const string &excFile) const
    {
      shared_ptr<const Lo16Op> lo16;
      shared_ptr<const Hi16Op> hi16;
      shared_ptr<const Lo17Op> lo17;
      shared_ptr<const SignedImmediate> imm;
      if (lo16 = shared_dynamic_cast<const Lo16Op>(opnd))
	{
	  shared_ptr<const OctaveUnaryExpr> expr 
	    = shared_static_cast<const OctaveUnaryExpr>(opnd);
	  imm = shared_dynamic_cast<const SignedImmediate>(expr->getOpnd());
	  if (imm) 
	    {
	      checkSImmRange(imm, 16, alo, excLine, excFile);
	    }
	}
      else if (hi16 = shared_dynamic_cast<const Hi16Op>(opnd))
	{
	  shared_ptr<const OctaveUnaryExpr> expr 
	    = shared_static_cast<const OctaveUnaryExpr>(opnd);
	  imm = shared_dynamic_cast<const SignedImmediate>(expr->getOpnd());
	  if(imm)
	    {
	      checkSImmRange(imm, 16, alo, excLine, excFile);
	    }
	}
      else if (lo17 = shared_dynamic_cast<const Lo17Op>(opnd))
	{
	  shared_ptr<const OctaveUnaryExpr> 
	    expr = shared_static_cast<const OctaveUnaryExpr>(opnd);
	  imm = shared_dynamic_cast<const SignedImmediate>(expr->getOpnd());
	  if (imm)
	    {
	    checkSImmRange(imm, 17, alo, excLine, excFile);
	    }
	}
      else // No check as we assume the operand is another well formed expression
	;
    }
  
  
  void
  M480SemanticAnalysisVisitor::
  checkSImmRange (shared_ptr<const LlirOperand> opnd, 
		  unsigned int bits,
		  OctaveAlo &alo,
		  unsigned int excLine,
		  const string &excFile) const
  {
    shared_ptr<std::exception> exc; 
    shared_ptr<const SignedImmediate> simm 
      = shared_dynamic_cast<const SignedImmediate>(opnd);
    if(simm)
      {
	unsigned long val = (unsigned long) simm->getValue();
	unsigned long mask1 = 0x1 << (bits - 1);
	unsigned long mask2 = 0xffff << bits;
	if (((val & mask1 == mask1) && (val & mask2 != mask2))
	    ||
	    ((val & mask1 == 0    ) && (val & mask2 != 0    )))
	  {
	    char *excStr = new char[128];
	    sprintf(excStr, "value %ld exceeeds %d signed bits range", 
		    val, bits); 
	    exc = shared_ptr<OutOfRangeOperand> 
	      (new OutOfRangeOperand
	       (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
	  }
      } 
    else 
      {
	LLIR_INTERNAL_EXCEPTION("other operand found where immediate was expected");
      }
  }
  
  
  void
  M480SemanticAnalysisVisitor::
  checkUImm16Range (OctaveAlo &alo,
		    shared_ptr<const LlirOperand> opnd, 
		    unsigned int excLine,
		    const string &excFile) const
    {
      shared_ptr<const Lo16Op> lo16;
      shared_ptr<const Hi16Op> hi16;
      shared_ptr<const UnsignedImmediate> imm;
      
