testhound/alo/alo/octave/m480/M480SemanticVisitor.cpp
      if (lo16 = shared_dynamic_cast<const Lo16Op>(opnd))
	{
	  shared_ptr<const OctaveUnaryExpr> expr 
	    = shared_static_cast<const OctaveUnaryExpr>(opnd);
	  imm = shared_dynamic_cast<const UnsignedImmediate>(expr->getOpnd());
	  if (imm)
	    {
	      checkSImmRange(imm, 16, alo, excLine, excFile);
	    }
	}
      else if (hi16 = shared_dynamic_cast<const Hi16Op>(opnd))
	{
	  shared_ptr<const OctaveUnaryExpr> expr 
	    = shared_static_cast<const OctaveUnaryExpr>(opnd);
	  imm = shared_dynamic_cast<const UnsignedImmediate>(expr->getOpnd());
	  if (imm)
	    {
	      checkSImmRange(imm, 16, alo, excLine, excFile);
	    }
	}
      else // No check as we assume the operand is another well formed expression
	;
    }
  
  
  void
  M480SemanticAnalysisVisitor::
  checkUImmRange (shared_ptr<const LlirOperand> opnd, 
		  unsigned int bits,
		  OctaveAlo &alo,
		  unsigned int excLine,
		  const string &excFile) const
  {
    shared_ptr<std::exception> exc; 
    shared_ptr<const UnsignedImmediate> uimm 
      = shared_dynamic_cast<const UnsignedImmediate>(opnd);
    if(uimm)
      {
	unsigned long val = uimm->getValue();
	unsigned long max = 0x1 << bits;
	if (!(val <= max))
	  {
	    char *excStr = new char[128];
	    sprintf(excStr, "value %ld exceeds %d bits range", val, bits); 
	    exc = shared_ptr<OutOfRangeOperand> 
	      (new OutOfRangeOperand
	       (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
	  }
      } 
    else 
      {
	LLIR_INTERNAL_EXCEPTION("other operand found where immediate was expected");
      }
  }
  
  
  void
  M480SemanticAnalysisVisitor::
  checkAlignment (shared_ptr<const LlirOperand> opnd, 
		  unsigned int unit,
		  OctaveAlo &alo,
		  unsigned int excLine,
		  const string &excFile) const
  {
    shared_ptr<std::exception> exc; 
    shared_ptr<const UnsignedImmediate> uimm 
      = shared_dynamic_cast<const UnsignedImmediate>(opnd);
    if(uimm)
      {
	unsigned long val = uimm->getValue();
	if (val % unit != 0)
	  {
	    char *excStr = new char[128];
	    sprintf(excStr, "value %ld not aligned on %d bit boundary", 
		    val, unit);   
	    exc = shared_ptr<OutOfRangeOperand> 
	      (new OutOfRangeOperand
	       (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
	  }
      } 
    else 
      {
	LLIR_INTERNAL_EXCEPTION("other operand found where immediate was expected");
      }
  }
  
  // Check that the register operand is either a pseudo register or a register in the range r0-127
  void
  M480SemanticAnalysisVisitor::
  checkOctaveRegister (shared_ptr<const LlirOperand> opnd,
		 OctaveAlo &alo,
		 unsigned int excLine,
		 const string &excFile) const
  {
    shared_ptr<std::exception> exc; 
    shared_ptr<const Register> reg 
      = shared_dynamic_cast<const Register>(opnd);
    if(reg)
      {
	if (reg->isPseudo())
	  return;

	unsigned int regNum = reg->getRegNum(); 
	if (regNum < 0 || regNum > 128)
	  {  
	    char *excStr = new char[128];
	    sprintf(excStr, "register r%d is not a octave register (r0-r127)", regNum);
	    exc = shared_ptr<IllegalRegisterOperand> 
	      (new IllegalRegisterOperand
	       (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
	  }
      } 
    else 
      {
	LLIR_INTERNAL_EXCEPTION("other operand found where register was expected");
      }
  }
  
  // Check that the register operand is either a pseudo register or a software register in the range r0-r63

  void
  M480SemanticAnalysisVisitor::
  checkRegister (shared_ptr<const LlirOperand> opnd,
		 OctaveAlo &alo,
		 unsigned int excLine,
		 const string &excFile) const
  {
    shared_ptr<const Register> reg 
      = shared_dynamic_cast<const Register>(opnd);
    if(reg)
      {
	if (reg->isPseudo())
	  return;

	unsigned int regNum = reg->getRegNum(); 
	if (regNum > 63)
	  {  
	    shared_ptr<std::exception> exc; 
	    char *excStr = new char[128];
	    sprintf(excStr, "register r%d is not a sofware register (r0-r63)", regNum);
	    exc = shared_ptr<IllegalRegisterOperand> 
	      (new IllegalRegisterOperand
	       (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
	  }
      } 
    else 
      {
	LLIR_INTERNAL_EXCEPTION("other operand found where register was expected");
      }
  }
  
  
  void
  M480SemanticAnalysisVisitor::
  checkMultiRegister (shared_ptr<const MultiRegister> regs,
		      OctaveAlo &alo,
		      unsigned int excLine,
		      const string &excFile) const
  {
    shared_ptr<std::exception> exc; 
    int regFirst = (int)regs->getRegNum(); 
    int regLast = regFirst + (int)regs->getNumRegs() - 1; 

    if (regFirst > 63 && regFirst < 128)
      {  
	char *excStr = new char[128];
	sprintf(excStr, "register range starts illegally at r%d", regFirst);
	exc = shared_ptr<IllegalRegisterOperand> 
	  (new IllegalRegisterOperand
	   (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	alo.logException(exc);
	delete excStr;
      }

    if (regLast > 63 && regLast < 128)
      {  
	char *excStr = new char[128];
	sprintf(excStr, "register range extends illegally to r%d", regLast);
	exc = shared_ptr<IllegalRegisterOperand> 
	  (new IllegalRegisterOperand
	   (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	alo.logException(exc);
	delete excStr;
      }

    unsigned int numRegs = regs->getNumRegs();

    if(numRegs > 16)
      {
	char *excStr = new char[128];
	sprintf(excStr, "register range spans more than 16 registers : %d", numRegs);
	exc = shared_ptr<IllegalRegisterOperand> 
	  (new IllegalRegisterOperand
	   (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	alo.logException(exc);
	delete excStr;
      }
  }
  
  
  void
  M480SemanticAnalysisVisitor::
  checkRegisterPair (shared_ptr<const MultiRegister> regs,
		     OctaveAlo &alo,
		     unsigned int excLine,
		     const string &excFile) const
  {
    shared_ptr<std::exception> exc; 
    unsigned int regFirst = regs->getRegNum(); 
    unsigned int regNum = regs->getNumRegs();

    if (regNum > 2) // Accept a single register as well as a 2 register multi-register
      {  
	char *excStr = new char[128];
	sprintf(excStr, "DMA register range can only be 2 registers, not %d", regNum);
	exc = shared_ptr<IllegalRegisterOperand> 
	  (new IllegalRegisterOperand
	   (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	alo.logException(exc);
	delete excStr;
      } 
    if (regFirst > 63 && regFirst < 128)
      {  
	char *excStr = new char[128];
	sprintf(excStr, "register pair starts out of range at r%d", regFirst);
	exc = shared_ptr<IllegalRegisterOperand> 
	  (new IllegalRegisterOperand
	   (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	alo.logException(exc);
	delete excStr;
      }
    if (regFirst % 2 != 0)
      {  
	char *excStr = new char[128];
	sprintf(excStr, "First DMA register must be even - r%d is odd", regFirst);
	exc = shared_ptr<IllegalRegisterOperand> 
	  (new IllegalRegisterOperand
	   (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	alo.logException(exc);
	delete excStr;
      }
  }
  
  
  void
  M480SemanticAnalysisVisitor::
  checkBranchRegister (shared_ptr<const LlirOperand> opnd,
		       OctaveAlo &alo,
		       unsigned int excLine,
		       const string &excFile) const
  {
    shared_ptr<std::exception> exc; 
    shared_ptr<const Register> reg 
      = shared_dynamic_cast<const Register>(opnd);
    if(reg)
      {
	if (reg->isPseudo())
	  return;

