testhound/alo/alo/octave/m480/M480SemanticVisitor.cpp
	if (!isNullReg(reg))
	  {
	    unsigned int regNum = reg->getRegNum(); 
	    if (regNum < 60 || regNum > 62)
	      {   
		char *excStr = new char[128];
		sprintf(excStr, "register r%d should be r60, r61 or r62", regNum);
		exc = shared_ptr<IllegalRegisterOperand> 
		  (new IllegalRegisterOperand
		   (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
		alo.logException(exc);
		delete excStr;
	      }
	  }
      } 
    else
      LLIR_INTERNAL_EXCEPTION("other operand found where register was expected");
  }
  
  
  void
  M480SemanticAnalysisVisitor::
  checkHwRegister (shared_ptr<const LlirOperand> opnd,
		   OctaveAlo &alo,
		   unsigned int excLine,
		   const string &excFile) const
  {
    shared_ptr<std::exception> exc; 
    shared_ptr<const Register> reg 
      = shared_dynamic_cast<const Register>(opnd);
    if(reg)
      {
	unsigned int regNum = reg->getRegNum();
	if (regNum < 64 || regNum > 127)
	  {  
	    char *excStr = new char[128];
	    sprintf(excStr, "register r%d is not a h/w register", regNum);
	    exc = shared_ptr<IllegalRegisterOperand> 
	      (new IllegalRegisterOperand
	       (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
	  }
      } else {
	shared_ptr<const OpndNull> nil 
	  = shared_dynamic_cast<const OpndNull>(opnd);
	if (!nil)
	  {

	    LLIR_INTERNAL_EXCEPTION("other operand found where register was expected");

	  }
      }
  }
  
  
  void
  M480SemanticAnalysisVisitor::
  checkMemory (shared_ptr<const OctaveMemory> mem,
	       MemoryRegion memregion,
	       unsigned int regOffBits,
	       unsigned int basOffBits,
	       OctaveAlo &alo,
	       unsigned int excLine,
	       const string &excFile) const
  {
    shared_ptr<std::exception> exc; 
    shared_ptr<const Register> reg;
    shared_ptr<const LlirOperand> offexp = mem->getOffset();
    shared_ptr<const RegPlusOffsetIndirect> regoff
      = shared_dynamic_cast<const RegPlusOffsetIndirect>(mem);
    shared_ptr<const ImpliedBase2Offset> impoff
      = shared_dynamic_cast<const ImpliedBase2Offset>(mem);
    shared_ptr<const BasePlusOffset> basoff
      = shared_dynamic_cast<const BasePlusOffset>(mem);

    if (impoff)
      {
	assert(!basoff);
	// This is a "plain" offset argument that will become a BASE2 in the backend assembler.
	// convert it to a Base2PlusOffset, via a BasePlusOffset ptr, and test it as such for 
	// the remainder of this function.
	basoff = shared_ptr<const BasePlusOffset> (new Base2PlusOffset(impoff->getOffset()));
      }


    if (regoff)
      {
	reg = regoff->getBaseRegister();
	unsigned int regNum = reg->getRegNum(); 
	if (regNum > 63 && regNum < 128)
	  {  
	    char *excStr = new char[128];
	    sprintf(excStr, "register r%d is not a s/w register", regNum);
	    exc = shared_ptr<IllegalRegisterOperand> 
	      (new IllegalRegisterOperand
	       (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
	  }
	shared_ptr<const SignedImmediate> 
	  si = shared_dynamic_cast<const SignedImmediate>(offexp);
	if(si)
	  {
	    long off = si->getValue();
	    // mask1 lets through the sign bit alone
	    // mask2 lets through the bits higher the sign bit
	    unsigned long mask1 = 0x1 << (regOffBits - 1);
	    unsigned long mask2 = 0xffff << regOffBits;
	    // if the sign bit is 1, the bits higher than it must be 1
	    // if the sign bit is 0, the bits higher than it must be zero
	    // anything else is an erroneous value
	    if (((off & mask1 == mask1) && (off & mask2 != mask2))
		||
		((off & mask1 == 0    ) && (off & mask2 != 0    )))
	      {
		char *excStr = new char[128];
		sprintf(excStr, "value %ld exceeeds %d signed bits range", 
			off, regOffBits); 
		exc = shared_ptr<OutOfRangeOperand> 
		  (new OutOfRangeOperand
		   (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
		alo.logException(exc);
		delete excStr;
	      }
	  }
	// no check at compile time if the operand is an expression
      }
    if (basoff)
      {
	// base plus offset memory expressions are allowed only within
	// certain memory regions, and then only for a certain base

	checkMemoryRegion (basoff,
			   memregion,
			   alo,
			   excLine,
			   excFile);
	
	// max is the power of two just above the maximum value 
	// that can be contained in the bit field
	
	long max = 0x1 << basOffBits;
	shared_ptr<const UnsignedImmediate> 
	  usi = shared_dynamic_cast<const UnsignedImmediate>(offexp);
	if(usi)
	  {
	    long off = usi->getValue();
	    if (!(off <= max))
	      {
		char *excStr = new char[128];
		sprintf(excStr, "value %ld exceeds %d bits range", 
			off, basOffBits); 
		exc = shared_ptr<OutOfRangeOperand> 
		  (new OutOfRangeOperand
		   (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
		alo.logException(exc);
		delete excStr;
	      }
	  }
	// no check at compile time, if the operand is an expression
      }

    if (regoff || basoff)
      {
	checkAlignment(offexp, 4, alo, excLine, excFile);
      }
    else
      {
	LLIR_INTERNAL_EXCEPTION("other operand found where register was expected");
      }
  }
  
  
  void
  M480SemanticAnalysisVisitor::
  checkMemoryRegion (shared_ptr<const BasePlusOffset> basoff,
		     MemoryRegion memreg,
		     OctaveAlo &alo,
		     unsigned int excLine,
		     const string &excFile) const
  {
    shared_ptr<std::exception> exc;
    shared_ptr<const Base2PlusOffset> base2 
      = shared_dynamic_cast<const Base2PlusOffset>(basoff);
    shared_ptr<const Base3PlusOffset> base3 
      = shared_dynamic_cast<const Base3PlusOffset>(basoff); 
    if (memreg == SIO || memreg == SRAM || memreg == SDRAM) 
      {
	char *excStr = new char[128];
	sprintf(excStr, "This instruction does not allow Base memory address");
	exc = shared_ptr<IllegalMappingOperand> 
	  (new IllegalMappingOperand
	   (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	alo.logException(exc);
	delete excStr;
      }
    else if (memreg == SPRAM && !base2)
      {
	char *excStr = new char[128];
	sprintf(excStr, "Base3 not allowed with SPRAM instructions");
	exc = shared_ptr<IllegalMappingOperand> 
	  (new IllegalMappingOperand
	   (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	alo.logException(exc);
	delete excStr;
      }
    else if (memreg == CCRAM && !base3)
      {
	char *excStr = new char[128];
	sprintf(excStr, "Base2 not allowed with CCRAM instructions");
	exc = shared_ptr<IllegalMappingOperand> 
	  (new IllegalMappingOperand
	   (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	alo.logException(exc);
	delete excStr;
      }
  }
  
  
  void
  M480SemanticAnalysisVisitor::
  checkTssFlags (shared_ptr<const LlirOperand> fl,
		 TssOp op,
		 OctaveAlo &alo,
		 unsigned int excLine,
		 const string &excFile) const
  {
    shared_ptr<std::exception> exc; 
    TrafficScheduleFlags::ConstIterator iter;
    shared_ptr<const TSSFlag> flag;
    OctaveFlagIdentificationVisitor idv;

    shared_ptr<const TrafficScheduleFlags> flags = 
      shared_dynamic_cast<const TrafficScheduleFlags>(fl);

    if(flags)
      {
	for (iter = flags->begin();  iter != flags->end(); iter++)
	  {
	    flag = *iter;
	    flag->accept(idv);
	  }
	if(op != POL 
	   && idv.isFlagPresent(OctaveFlagIdentificationVisitor::GW)
	   && !idv.isFlagPresent(OctaveFlagIdentificationVisitor::GR))
	  {
	    char *excStr = new char[128];
	    sprintf(excStr, "GW flag requires presence of GR flag");
	    exc = shared_ptr<IllegalFlag> 
	      (new IllegalFlag
	       (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
	  } 
	if(op == POL 
	   && !idv.isFlagPresent(OctaveFlagIdentificationVisitor::GR))
	  {
	    char *excStr = new char[128];
	    sprintf(excStr, "this operation requires presence of GR flag");
	    exc = shared_ptr<IllegalFlag> 
	      (new IllegalFlag
	       (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
	  } 
	if(op == POL 
	   && !idv.isFlagPresent(OctaveFlagIdentificationVisitor::NB))
	  {
	    char *excStr = new char[128];
	    sprintf(excStr, "this operation requires presence of NB flag");
	    exc = shared_ptr<IllegalFlag> 
	      (new IllegalFlag
	       (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
	  } 
	if(op == GET 
	   && idv.isFlagPresent(OctaveFlagIdentificationVisitor::GU))
	  {
	    char *excStr = new char[128];
	    sprintf(excStr, "GET instruction disallows presence of GU flag");
	    exc = shared_ptr<IllegalFlag> 
	      (new IllegalFlag
	       (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
	  } 
	if(op == GET 
	   && idv.isFlagPresent(OctaveFlagIdentificationVisitor::A)
	   && idv.isFlagPresent(OctaveFlagIdentificationVisitor::RB))
	  {
	    char *excStr = new char[128];
	    sprintf(excStr, "\"A\" flag disallows presence of RB flag");
	    exc = shared_ptr<IllegalFlag> 
	      (new IllegalFlag
	       (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
	  } 
	if(op == GET 
	   && idv.isFlagPresent(OctaveFlagIdentificationVisitor::A)
	   && !idv.isFlagPresent(OctaveFlagIdentificationVisitor::NC))
	  {
	    char *excStr = new char[128];
	    sprintf(excStr, "\"A\" flag requires presence of NC flag");
	    exc = shared_ptr<IllegalFlag> 
	      (new IllegalFlag
	       (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
	  }
      } else {
	shared_ptr<const OpndNull> nil 
	  = shared_dynamic_cast<const OpndNull>(fl);
	if (!nil)
	  {

	       LLIR_INTERNAL_EXCEPTION("other operand found where TSS flags were expected");

