testhound/alo/alo/octave/m480/M480SemanticVisitor.cpp
	  }
      } 
  }
  
  
  void
  M480SemanticAnalysisVisitor::
  checkBitField (shared_ptr<const LlirOperand> start,
		 shared_ptr<const LlirOperand> length,
		 OctaveAlo &alo,
		 unsigned int excLine,
		 const string &excFile) const
  {
    shared_ptr<std::exception> exc;
    shared_ptr<const UnsignedImmediate> ustart =
      shared_dynamic_cast<const UnsignedImmediate>(start);
    shared_ptr<const UnsignedImmediate> ulength =
      shared_dynamic_cast<const UnsignedImmediate>(length);
    unsigned long str = ustart->getValue(); 
    unsigned long len = ulength->getValue(); 
    if (str + len > 32)
      {
	char *excStr = new char[128];
	sprintf(excStr, 
		"Field exceeds word length: %ld bits starting at bit %ld", 
		len, str);
	exc = shared_ptr<IllegalBitopOperand> 
	  (new IllegalBitopOperand
	   (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	alo.logException(exc);
	delete excStr;
      }
  }

  void
  M480SemanticAnalysisVisitor::
  checkSingleWordDest(shared_ptr<const MultiRegister> regs,
		      OctaveAlo &alo,
		      unsigned int excLine,
		      const string &excFile) const
  {
    shared_ptr<std::exception> exc; 
    if (regs->getNumRegs() != 1)
      {
	char *excStr = new char[128];
	sprintf(excStr, "undefined behavior when destination is more than 1 register (%d registers specified)", regs->getNumRegs());
	exc = shared_ptr<IllegalDestWordLength> 
	  (new IllegalDestWordLength
	   (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	alo.logException(exc);
	delete excStr;
      }
  }

  extern shared_ptr<const PrototypeDirective>
  searchForValidPrototype(shared_ptr<const LabelList> labelList);

  extern PrototypeListIter searchForValidPrototype(const char* name);

  void
  M480SemanticAnalysisVisitor::checkIfCallInsn(shared_ptr<const LlirOperand> dst,
					       shared_ptr<const LlirOperand> labelList,
					       OctaveAlo &alo,
					       unsigned int excLine,
					       const string &excFile) const
  {
    shared_ptr<const IndirectCallTargetList> targetList = 
      shared_dynamic_cast<const IndirectCallTargetList>(labelList);

    shared_ptr<const Register> rpc =
      shared_dynamic_cast<const Register>(dst);

    if(rpc)
      {
	unsigned int rpcRegNum = rpc->getRegNum();
	bool callInsn = false;
	
	if(rpcRegNum == 60 ||
	   rpcRegNum == 61 ||
	   rpcRegNum == 62)
	  {
	    callInsn = true;
	  }
	
	if(callInsn)
	  {
	    if(targetList)
	      {
		searchForValidPrototype(targetList->getLabelList());
	      }
	    else
	      {
		char *excStr = new char[128];
		sprintf(excStr, "@indcall label_list not specified for indirect call insn");
		shared_ptr<std::exception> exc = shared_ptr<MissingRequiredOperand> 
		  (new MissingRequiredOperand
		   (excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
		alo.logException(exc);
		delete excStr;
	      }
	  }
      }
  }


  /*
    Make sure that all labels in @indir
    label list have the same matching 
    prototypes.
  */

  void 
  M480SemanticAnalysisVisitor::checkIndirectEntryLabels(unsigned int excLine,
							const string &file,
							shared_ptr<const LlirOperand> list) const
  {
    shared_ptr<const IndirectCallTargetList> iList = 
      shared_dynamic_cast<const IndirectCallTargetList>(list);

    if(iList)
      {
	shared_ptr<const LabelList> labelList = iList->getLabelList();

	const char* excFile = file.c_str();
	
	shared_ptr<const PrototypeDirective> p;
	
	PrototypeListIter piter;
	
	if(labelList->begin() == labelList->end())
	  {
	    char *excStr = new char[128];
	    
	    sprintf(excStr, "Error:%s:%d: empty indirect label list created", excFile, excLine);
	    
	    throw ALO_INTERNAL_EXCEPTION(excStr);
	    
	    delete excStr;
	  }


	//search for the first label...

	LabelList::ConstIterator iter = labelList->begin();

	const char *pname = (*iter)->getName().c_str();

	piter = searchForValidPrototype(pname);

	if(piter != g_prototypeDirList.end())
	  {
	    p = piter->second;
	  }
	
	//make sure the rest of labels in the list match
	//the with the first
	
	for(; iter != labelList->end(); iter++)
	  {
	    const char *name = (*iter)->getName().c_str();
	    
	    piter = searchForValidPrototype(name);
	
	    if(piter != g_prototypeDirList.end())
	      {
		
		if(*p != *piter->second)
		  {
		    char *excStr = new char[128];
		    
		    sprintf(excStr, "Error:%s:%d: prototype for '%s' does not match '%s' ", excFile, excLine, name, pname);
		    
		    throw ALO_INTERNAL_EXCEPTION(excStr);
		    
		    delete excStr;
		
		    break;
		  }
	      }
	  }
      }
  }

  ///////////////////////////////////////////
  // Invalid instruction visitor.
  ///////////////////////////////////////////

  void 
  M480SemanticAnalysisVisitor::visit(const InvalidOctaveInstruction &i) 
  {
    shared_ptr<InvalidInstructionException> exc = shared_ptr<InvalidInstructionException>
      (new InvalidInstructionException("illegal instruction for 4800 architecture",
				       i.getSrcLineNum(), 
				       i.getSrcFile().c_str(), 
				       __LINE__, __FILE__));
    getAlo().logException(exc);
  }
  
  ///////////////////////////////////////////
  // visit addwh
  ///////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480AddwhInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
  
  ///////////////////////////////////////////
  // visit jaddwh
  ///////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JaddwhInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    shared_ptr<const LlirOperand> bt = i.getBranchTarget();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);

    if(!bt->isNullOperand())
      checkForValidLabel(alo, bt, excLine, excFile);
  }
  
