testhound/alo/alo/octave/m480/M480SemanticVisitor.cpp
  ////////////////////////////////////////////
  // visit addwl
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480AddwlInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
    
  ////////////////////////////////////////////
  // visit jaddwl
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JaddwlInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    shared_ptr<const LlirOperand> bt = i.getBranchTarget();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);

    if(!bt->isNullOperand())
      checkForValidLabel(alo, bt, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit addww
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480AddwwInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
    
  ////////////////////////////////////////////
  // visit jaddww
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JaddwwInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    shared_ptr<const LlirOperand> bt = i.getBranchTarget();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);

    if(!bt->isNullOperand())
      checkForValidLabel(alo, bt, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit addl
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480AddlInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit addl
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JaddlInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    shared_ptr<const LlirOperand> bt = i.getBranchTarget();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);

    if(!bt->isNullOperand())
      checkForValidLabel(alo, bt, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit subwh
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480SubwhInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }  

  ////////////////////////////////////////////
  // visit jsubwh
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JsubwhInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    shared_ptr<const LlirOperand> bt = i.getBranchTarget();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);

    if(!bt->isNullOperand())
      checkForValidLabel(alo, bt, excLine, excFile);
  }
  
  
  ////////////////////////////////////////////
  // visit subwl
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480SubwlInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit jsubwl
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JsubwlInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    shared_ptr<const LlirOperand> bt = i.getBranchTarget();

    checkRegister(src1, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);

    if(!bt->isNullOperand())
      checkForValidLabel(alo, bt, excLine, excFile);
  }
  

