testhound/alo/alo/octave/m480/M480SemanticVisitor.cpp
  ////////////////////////////////////////////
  // visit addli
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480AddliInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkUImmRange(src1, 6, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
    
  ////////////////////////////////////////////
  // visit jaddli
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JaddliInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    shared_ptr<const LlirOperand> bt = i.getBranchTarget();

    
    checkUImmRange(src1, 6, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);

    if(!bt->isNullOperand())
      checkForValidLabel(alo, bt, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit subwhi
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480SubwhiInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkUImmRange(src1, 6, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
    
  ////////////////////////////////////////////
  // visit jsubwhi
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JsubwhiInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    shared_ptr<const LlirOperand> bt = i.getBranchTarget();
    
    checkUImmRange(src1, 6, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);

    if(!bt->isNullOperand())
      checkForValidLabel(alo, bt, excLine, excFile);
  }
  

  ////////////////////////////////////////////
  // visit subwli
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480SubwliInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkUImmRange(src1, 6, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit jsubwli
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JsubwliInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    shared_ptr<const LlirOperand> bt = i.getBranchTarget();
    
    checkUImmRange(src1, 6, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);

    if(!bt->isNullOperand())
      checkForValidLabel(alo, bt, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit subwwi
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480SubwwiInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkUImmRange(src1, 6, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
   
  ////////////////////////////////////////////
  // visit subwwi
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JsubwwiInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    shared_ptr<const LlirOperand> bt = i.getBranchTarget();

    checkUImmRange(src1, 6, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);

    if(!bt->isNullOperand())
      checkForValidLabel(alo, bt, excLine, excFile);
  }
   
  ////////////////////////////////////////////
  // visit subli
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480SubliInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkUImmRange(src1, 6, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
     
  ////////////////////////////////////////////
  // visit jsubli
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JsubliInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    shared_ptr<const LlirOperand> bt = i.getBranchTarget();

    checkUImmRange(src1, 6, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);

    if(!bt->isNullOperand())
      checkForValidLabel(alo, bt, excLine, excFile);
  }
  
