testhound/alo/alo/octave/m480/M480SemanticVisitor.cpp
  ////////////////////////////////////////////
  // visit subb
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480SubbInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(src2, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit subbi
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480SubbiInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkUImmRange(src2, 6, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit and
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480AndInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(src2, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit or
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480OrInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(src2, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit xor
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480XorInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(src2, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit max
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480MaxInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(src2, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit min
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480MinInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(src2, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit rand
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480RandInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(src2, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit rotl
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480RotlInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(src2, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit rotr
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480RotrInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(src2, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
  
