testhound/alo/alo/octave/m480/M480SemanticVisitor.cpp
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    shared_ptr<const LlirOperand> targetList = i.getTargetLabelList();

    checkRegister(src1, alo, excLine, excFile);
    checkBranchRegister(dst, alo, excLine, excFile);
    checkIfCallInsn(dst, targetList, alo, excLine, excFile);
    checkIndirectEntryLabels(excLine, excFile, targetList);
  }
  ////////////////////////////////////////////
  // visit bcr
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480BcrInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkBranchRegister(dst, alo, excLine, excFile);
  }
    
  ////////////////////////////////////////////
  // visit jbcr
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JbcrInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    shared_ptr<const LlirOperand> targetList = i.getTargetLabelList();

    checkRegister(src1, alo, excLine, excFile);
    checkBranchRegister(dst, alo, excLine, excFile);
    checkIfCallInsn(dst, targetList, alo, excLine, excFile);
    checkIndirectEntryLabels(excLine, excFile, targetList);
  }
  
  ////////////////////////////////////////////
  // visit bi
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480BiInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src = i.getSrc1();
    checkForValidLabel(alo, src, excLine, excFile);
    
    shared_ptr<const LlirOperand> dst = i.getDst();
    checkForReturnRegister(alo, dst, excLine, excFile);

    shared_ptr<const LlirOperand> cdFlag = i.getCdFlag();
    checkForValidCDFlag(alo, cdFlag, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit jbi
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JbiInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src = i.getSrc1();
    checkForValidLabel(alo, src, excLine, excFile);
    
    shared_ptr<const LlirOperand> dst = i.getDst();
    checkForReturnRegister(alo, dst, excLine, excFile);

    shared_ptr<const LlirOperand> cdFlag = i.getCdFlag();
    checkForValidCDFlag(alo, cdFlag, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit br
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480BrInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkBranchRegister(dst, alo, excLine, excFile);
  }


  ////////////////////////////////////////////
  // visit jablebr
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JtablebrInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    // FIXME: Check label (dst) here?
  }
    
  ////////////////////////////////////////////
  // visit jablebr
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JtableRelativebrInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    // FIXME: Check label (dst) here?
  }

  ////////////////////////////////////////////
  // visit jbr
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JbrInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    shared_ptr<const LlirOperand> targetList = i.getTargetLabelList();

    checkRegister(src1, alo, excLine, excFile);
    checkBranchRegister(dst, alo, excLine, excFile);  
    checkIfCallInsn(dst, targetList, alo, excLine, excFile);
    checkIndirectEntryLabels(excLine, excFile, targetList);
  }
  
  ////////////////////////////////////////////
  // visit bcdi
  ////////////////////////////////////////////

  void
  M480SemanticAnalysisVisitor::visit(const M480BcdiInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src = i.getSrc1();
    checkForValidLabel(alo, src, excLine, excFile);
    
    shared_ptr<const LlirOperand> ess = i.getEss();
    checkForValidESSFlag(alo, ess, excLine, excFile);

    shared_ptr<const LlirOperand> dst = i.getDst();
    checkForReturnRegister(alo, dst, excLine, excFile);

    shared_ptr<const LlirOperand> cbrFlags = i.getFlags();
    checkForValidCandBfFlags(alo, cbrFlags, excLine, excFile);
  }
    
