testhound/alo/alo/octave/m480/M480SemanticVisitor.cpp
  ////////////////////////////////////////////
  // visit jbcdi
  ////////////////////////////////////////////

  void
  M480SemanticAnalysisVisitor::visit(const M480JbcdiInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    

    
    shared_ptr<const LlirOperand> src = i.getSrc1();
    checkForValidLabel(alo, src, excLine, excFile);
    
    shared_ptr<const LlirOperand> ess = i.getEss();
    checkForValidESSFlag(alo, ess, excLine, excFile);

    shared_ptr<const LlirOperand> dst = i.getDst();
    checkForReturnRegister(alo, dst, excLine, excFile);

    shared_ptr<const LlirOperand> cbrFlags = i.getFlags();
    checkForValidCandBfFlags(alo, cbrFlags, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit bci
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480BciInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
        
    shared_ptr<const LlirOperand> src = i.getSrc1();
    checkForValidLabel(alo, src, excLine, excFile);
    
    shared_ptr<const LlirOperand> ess = i.getEss();
    checkForValidESSFlag(alo, ess, excLine, excFile);

    shared_ptr<const LlirOperand> dst = i.getDst();
    checkForReturnRegister(alo, dst, excLine, excFile);

    shared_ptr<const LlirOperand> cbrFlags = i.getFlags();
    checkForValidCandBfFlags(alo, cbrFlags, excLine, excFile);

  }

  ////////////////////////////////////////////
  // visit jbci
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JbciInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
        
    shared_ptr<const LlirOperand> src = i.getSrc1();
    checkForValidLabel(alo, src, excLine, excFile);
    
    shared_ptr<const LlirOperand> ess = i.getEss();
    checkForValidESSFlag(alo, ess, excLine, excFile);

    shared_ptr<const LlirOperand> dst = i.getDst();
    checkForReturnRegister(alo, dst, excLine, excFile);

    shared_ptr<const LlirOperand> cbrFlags = i.getFlags();
    checkForValidCandBfFlags(alo, cbrFlags, excLine, excFile);

  }
  
  ////////////////////////////////////////////
  // visit bnzr
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480BnzrInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(src2, alo, excLine, excFile);
  }
    
  ////////////////////////////////////////////
  // visit jbnzr
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JbnzrInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    shared_ptr<const LlirOperand> rpc = i.getCmpReg();
    shared_ptr<const LlirOperand> targetList = i.getTargetLabelList();

    checkRegister(src1, alo, excLine, excFile);
    checkRegister(src2, alo, excLine, excFile);
    checkIfCallInsn(rpc, targetList, alo, excLine, excFile);
    checkIndirectEntryLabels(excLine, excFile, targetList);
 }
  
  ////////////////////////////////////////////
  // visit bzr
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480BzrInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(src2, alo, excLine, excFile);
  }
   
  ////////////////////////////////////////////
  // visit jbzr
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JbzrInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    shared_ptr<const LlirOperand> rpc = i.getCmpReg();
    shared_ptr<const LlirOperand> targetList = i.getTargetLabelList();

    checkRegister(src1, alo, excLine, excFile);
    checkRegister(src2, alo, excLine, excFile);
    checkIfCallInsn(rpc, targetList, alo, excLine, excFile);
    checkIndirectEntryLabels(excLine, excFile, targetList);
  }
  
  ////////////////////////////////////////////
  // visit bnzi
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480BnziInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    checkForValidLabel(alo, src2, excLine, excFile);
  }
    
  ////////////////////////////////////////////
  // visit jbnzi
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JbnziInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    checkForValidLabel(alo, src2, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit bzi
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480BziInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();

