testhound/alo/alo/octave/m480/M480SemanticVisitor.cpp
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    checkForValidLabel(alo, src2, excLine, excFile);   
  }
    

  ////////////////////////////////////////////
  // visit bzi
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JbziInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();

    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    checkForValidLabel(alo, src2, excLine, excFile);   
  }
  
  ////////////////////////////////////////////
  // visit tsetb
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480TsetbInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> bitp = i.getBitpos();
    
    checkRegister(src1, alo, excLine, excFile);
    checkUImmRange(bitp, 5, alo, excLine, excFile);
  }
    
  ////////////////////////////////////////////
  // visit jtsetb
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JtsetbInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> bitp = i.getBitpos();
    shared_ptr<const LlirOperand> bt = i.getDisp();

    checkRegister(src1, alo, excLine, excFile);
    checkUImmRange(bitp, 5, alo, excLine, excFile);

    if(!bt->isNullOperand())
      checkForValidLabel(alo, bt, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit tclrb
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480TclrbInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> bitp = i.getBitpos();
    
    checkRegister(src1, alo, excLine, excFile);
    checkUImmRange(bitp, 5, alo, excLine, excFile);
  }
    
  ////////////////////////////////////////////
  // visit jtclrb
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JtclrbInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> bitp = i.getBitpos();
    shared_ptr<const LlirOperand> bt = i.getDisp();
    
    checkRegister(src1, alo, excLine, excFile);
    checkUImmRange(bitp, 5, alo, excLine, excFile);

    if(!bt->isNullOperand())
      checkForValidLabel(alo, bt, excLine, excFile);
  }
  

  ////////////////////////////////////////////
  // visit rnmi
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480RnmiInstruction &i)
  {}

  
  ////////////////////////////////////////////
  // visit jrnmi
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JrnmiInstruction &i)
  {}  

  ////////////////////////////////////////////
  // visit rint
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480RintInstruction &i)
  {}
  
  ////////////////////////////////////////////
  // visit jrint
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JrintInstruction &i)
  {}

  ////////////////////////////////////////////
  // visit brs
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480BrsInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkBranchRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit jbrs
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JbrsInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkBranchRegister(dst, alo, excLine, excFile);
  }
  ////////////////////////////////////////////
  // visit brsl
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480BrslInstruction &i)
  {}
    
  ////////////////////////////////////////////
  // visit brsl
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JbrslInstruction &i)
  {}
  

  ////////////////////////////////////////////
  // visit brspre
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480BrspreInstruction &i)
  {}
  
  ////////////////////////////////////////////
  // visit cmp
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480CmpInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(src2, alo, excLine, excFile);
  }

  ////////////////////////////////////////////
  // visit jcmp
  ////////////////////////////////////////////

  void
  M480SemanticAnalysisVisitor::visit(const M480JcmpInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
