testhound/alo/alo/octave/m480/M480SemanticVisitor.cpp
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    shared_ptr<const LlirOperand> bt = i.getBranchTarget();

    checkRegister(src1, alo, excLine, excFile);
    checkRegister(src2, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit cmpi
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480CmpiInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();

    checkRegister(src1, alo, excLine, excFile);
    checkSImmRange(src2, 10, alo, excLine, excFile);
  }

  ////////////////////////////////////////////
  // visit jcmpi
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JcmpiInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    shared_ptr<const LlirOperand> bt = i.getBranchTarget();
    
    checkRegister(src1, alo, excLine, excFile);
    checkSImmRange(src2, 10, alo, excLine, excFile);
    if(!bt->isNullOperand())
      checkForValidLabel(alo, bt, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit cmpr
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480CmprInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    shared_ptr<const LlirOperand> dst  = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(src2, alo, excLine, excFile);
    checkRegister(dst , alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit cmpri
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480CmpriInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    shared_ptr<const LlirOperand> dst  = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkSImmRange(src2, 10, alo, excLine, excFile);
    checkRegister(dst , alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit depb
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480DepbInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1   = i.getSrc1();
    shared_ptr<const LlirOperand> srcbit = i.getSrcBitNum();
    shared_ptr<const LlirOperand> dst    = i.getDst();
    shared_ptr<const LlirOperand> dstbit = i.getDstBitNum();
    shared_ptr<const LlirOperand> numbit = i.getNumBits();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(dst , alo, excLine, excFile);

    checkUImmRange(srcbit, 5, alo, excLine, excFile);
    checkUImmRange(dstbit, 5, alo, excLine, excFile);
    checkUImmRange(numbit, 5, alo, excLine, excFile);
    checkBitField(srcbit, numbit, alo, excLine, excFile);
    checkBitField(dstbit, numbit, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit depbi
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480DepbiInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1   = i.getSrc1();
    shared_ptr<const LlirOperand> dst    = i.getDst();
    shared_ptr<const LlirOperand> dstbit = i.getDstBitNum();
    shared_ptr<const LlirOperand> numbit = i.getNumBits();
    
    checkUImmRange(src1, 9, alo, excLine, excFile);
    checkRegister(dst , alo, excLine, excFile);
    checkUImmRange(dstbit, 5, alo, excLine, excFile);
    checkUImmRange(numbit, 5, alo, excLine, excFile);
    checkBitField(dstbit, numbit, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit extb
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480ExtbInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1   = i.getSrc1();
    shared_ptr<const LlirOperand> srcbit = i.getSrcBitNum();
    shared_ptr<const LlirOperand> dst    = i.getDst();
    shared_ptr<const LlirOperand> dstbit = i.getDstBitNum();
    shared_ptr<const LlirOperand> numbit = i.getNumBits();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(dst , alo, excLine, excFile);
    checkUImmRange(srcbit, 5, alo, excLine, excFile);
    checkAlignment(dstbit, 4, alo, excLine, excFile);
    checkUImmRange(dstbit, 5, alo, excLine, excFile);
    checkUImmRange(numbit, 5, alo, excLine, excFile);
    checkBitField(srcbit, numbit, alo, excLine, excFile);
    checkBitField(dstbit, numbit, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit cmov
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480CmovInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    shared_ptr<const LlirOperand> dst  = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkRegister(src2, alo, excLine, excFile);
    checkRegister(dst , alo, excLine, excFile);
  }
  
