testhound/alo/alo/octave/m480/M480SemanticVisitor.cpp
  ////////////////////////////////////////////
  // visit cmovi
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480CmoviInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src1 = i.getSrc1();
    shared_ptr<const LlirOperand> src2 = i.getSrc2();
    shared_ptr<const LlirOperand> dst  = i.getDst();
    
    checkRegister(src1, alo, excLine, excFile);
    checkUImmRange(src2, 6, alo, excLine, excFile);
    checkRegister(dst , alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit dmap
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480DmapInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    
    checkRegisterPair(regs, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit dmasr
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480DmasrInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    
    checkRegisterPair(regs, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit dmau0
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480Dmau0Instruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    
    checkRegisterPair(regs, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit dmau1
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480Dmau1Instruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    
    checkRegisterPair(regs, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit lih
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LihInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src = i.getSrc();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkSImm17Range(alo, src, excLine, excFile);
    checkOctaveRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit lil
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LilInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src = i.getSrc();
    shared_ptr<const LlirOperand> dst = i.getDst();

    checkSImm17Range(alo, src, excLine, excFile);
    checkOctaveRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit lwih
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LwihInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src = i.getSrc();
    shared_ptr<const LlirOperand> dst = i.getDst();

    checkUImm16Range(alo, src, excLine, excFile);    
    checkRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit lwil
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LwilInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src = i.getSrc();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkUImm16Range(alo, src, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit laih
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LaihInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src = i.getSrc();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkSImm17Range(alo, src, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit lail
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LailInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src = i.getSrc();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkSImm17Range(alo, src, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit nop
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480NopInstruction &i)
  {}
  
  ////////////////////////////////////////////
  // visit hec5
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480Hec5Instruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    shared_ptr<const LlirOperand> wdt = i.getBytes();
    shared_ptr<const LlirOperand> bt = i.getBranchTarget();
    
    checkRegister(src, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
    checkUImmRange(wdt, 3, alo, excLine, excFile);

   if(!bt->isNullOperand())
      checkForValidLabel(alo, bt, excLine, excFile);
  }
    
