testhound/alo/alo/octave/m480/M480SemanticVisitor.cpp
  ////////////////////////////////////////////
  // visit hec5
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480JHec5Instruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src = i.getSrc1();
    shared_ptr<const LlirOperand> dst = i.getDst();
    shared_ptr<const LlirOperand> wdt = i.getBytes();
    shared_ptr<const LlirOperand> bt = i.getBranchTarget();

    checkRegister(src, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
    checkUImmRange(wdt, 3, alo, excLine, excFile);

    if(!bt->isNullOperand())
      checkForValidLabel(alo, bt, excLine, excFile);
  }

  ////////////////////////////////////////////
  // visit mv
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480MvInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src = i.getSrc();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit mvhr
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480MvhrInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src = i.getSrc();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkHwRegister(src, alo, excLine, excFile);
    checkRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit mvrh
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480MvrhInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const LlirOperand> src = i.getSrc();
    shared_ptr<const LlirOperand> dst = i.getDst();
    
    checkRegister(src, alo, excLine, excFile);
    checkHwRegister(dst, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit unlink
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480UnlinkInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    
    checkMultiRegister(regs, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit link
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LinkInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
    
    checkMultiRegister(regs, alo, excLine, excFile);
    checkMemory(mem, ANY, 10, 14, alo, excLine, excFile);

    //FIXME: nov 25th, 2002
    //check to make sure r63 cannot be linked
    //by means of lmm/link instructions (in both 470/480 SemV)

  }
  
  ////////////////////////////////////////////
  // visit links
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LinksInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
    
    checkMultiRegister(regs, alo, excLine, excFile);
    checkMemory(mem, SPRAM, 10, 14, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit linksp
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LinkspInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
    
    checkMultiRegister(regs, alo, excLine, excFile);
    checkMemory(mem, SPRAM, 10, 14, alo, excLine, excFile);
  }

  ////////////////////////////////////////////
  // visit linkspl
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LinksplInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
    
    checkMultiRegister(regs, alo, excLine, excFile);
    checkMemory(mem, SPRAM, 10, 14, alo, excLine, excFile);
  }

  ////////////////////////////////////////////
  // visit linksr
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LinksrInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
    
    checkMultiRegister(regs, alo, excLine, excFile);
    checkMemory(mem, SRAM, 10, 14, alo, excLine, excFile);
  }


  ////////////////////////////////////////////
  // visit linksd
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LinksdInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
    
    checkMultiRegister(regs, alo, excLine, excFile);
    checkMemory(mem, SDRAM, 10, 14, alo, excLine, excFile);
  }

