testhound/alo/alo/octave/m480/M480SemanticVisitor.cpp
  ////////////////////////////////////////////
  // visit linkcc
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LinkccInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
    
    checkMultiRegister(regs, alo, excLine, excFile);
    checkMemory(mem, CCRAM, 10, 14, alo, excLine, excFile);
  }

  ////////////////////////////////////////////
  // visit linkccl
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LinkcclInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
    
    checkMultiRegister(regs, alo, excLine, excFile);
    checkMemory(mem, CCRAM_LOCK, 10, 14, alo, excLine, excFile);
  }

  ////////////////////////////////////////////
  // visit linksio
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LinksioInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
    
    checkMultiRegister(regs, alo, excLine, excFile);
    checkMemory(mem, SIO, 10, 14, alo, excLine, excFile);
  }

  ////////////////////////////////////////////
  // visit lmm
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LmmInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
    
    checkMultiRegister(regs, alo, excLine, excFile);
    checkMemory(mem, ANY, 10, 14, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit lmmsp
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LmmspInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
    
    checkMultiRegister(regs, alo, excLine, excFile);
    checkMemory(mem, SPRAM, 10, 14, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit lmmspl
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LmmsplInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
    
    checkMultiRegister(regs, alo, excLine, excFile);
    checkMemory(mem, SPRAM, 10, 14, alo, excLine, excFile);
    checkSingleWordDest(regs, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit lmmss
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LmmsrInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
    
    checkMultiRegister(regs, alo, excLine, excFile);
    checkMemory(mem, SRAM, 10, 14, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit lmmsd
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LmmsdInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
    
    checkMultiRegister(regs, alo, excLine, excFile);
    checkMemory(mem, SDRAM, 10, 14, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit lmmcc
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LmmccInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
    
    checkMultiRegister(regs, alo, excLine, excFile);
    checkMemory(mem, CCRAM, 10, 14, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit lmmccl
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LmmcclInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
    
    checkMultiRegister(regs, alo, excLine, excFile);
    checkMemory(mem, CCRAM, 10, 14, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit lmmsi
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480LmmsiInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
    
    checkMultiRegister(regs, alo, excLine, excFile);
    checkMemory(mem, SIO, 10, 14, alo, excLine, excFile);
  }

