testhound/alo/alo/octave/m480/M480SemanticVisitor.cpp
  ////////////////////////////////////////////
  // visit ssp
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480SspInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const string &excFile = i.getSrcFile();
    OctaveAlo& alo = getAlo();
    
    shared_ptr<const MultiRegister> regs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
    
    checkMultiRegister(regs, alo, excLine, excFile);
    checkMemory(mem, SPRAM, 10, 14, alo, excLine, excFile);
  }
  
  ////////////////////////////////////////////
  // visit get
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480GetInstruction &i)
  {
    //FIXME:??
  }
  
  ////////////////////////////////////////////
  // visit putc
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480PutcInstruction &i)
  {
    //FIXME:??
  }
  
  ////////////////////////////////////////////
  // visit putm
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480PutmInstruction &i)
  {
    //FIXME:??
  }

  ////////////////////////////////////////////
  // visit putp
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480PutpInstruction &i)
  {
    //FIXME:??
  }

  ////////////////////////////////////////////
  // visit putd
  ////////////////////////////////////////////
  
  void
  M480SemanticAnalysisVisitor::visit(const M480PutdInstruction &i)
  {
    //FIXME:??
  }

}
